Ran Plan for 2 projects:

1. dir: `.` workspace: `default`
1. dir: `spanner-instance` workspace: `default`
---

### 1. dir: `.` workspace: `default`
**Plan Error**
```
running "/usr/local/bin/terraform plan -input=false -refresh -out \"/atlantis-data/repos/Onkar179/terraform-sample-repo/4/default/default.tfplan\"" in "/atlantis-data/repos/Onkar179/terraform-sample-repo/4/default": exit status 1
╷
│ Error: No configuration files
│ 
│ Plan requires configuration to be present. Planning without a configuration
│ would mark everything for destruction, which is normally not what is
│ desired. If you would like to destroy everything, run plan with the
│ -destroy option. Otherwise, create a Terraform configuration file (.tf
│ file) and try again.
╵

```

---
### 2. dir: `spanner-instance` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.cloud_spanner["test-instance"].google_spanner_instance.instance_processing_units[0] will be created
+ resource "google_spanner_instance" "instance_processing_units" {
      + config           = "regional-us-central1"
      + display_name     = "Spanner demo"
      + effective_labels = {
          + "env" = "demo"
        }
      + force_destroy    = false
      + id               = (known after apply)
      + labels           = {
          + "env" = "demo"
        }
      + name             = "test-instance"
      + num_nodes        = (known after apply)
      + processing_units = 100
      + project          = "onkar-17-cloud"
      + state            = (known after apply)
      + terraform_labels = {
          + "env" = "demo"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ spanner_instance_details = {
      + test-instance = {
          + spanner_instance_iam_details = {}
          + spanner_instance_id          = (known after apply)
        }
    }
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d spanner-instance
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http:/lock?id=Onkar179%252Fterraform-sample-repo%252Fspanner-instance%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d spanner-instance
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
### Plan Summary

2 projects, 1 with changes, 0 with no changes, 1 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```